
## Plan Result (repository)

[CI link](https://github.com/tqer39/terraform-github/actions/runs/4589021064)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.tqer39.github_branch.this
  * module.tqer39.github_branch_default.this
  * module.tqer39.github_repository.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.tqer39.github_branch.this will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "tqer39"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.tqer39.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + id         = (known after apply)
      + rename     = false
      + repository = "tqer39"
    }

  # module.tqer39.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A repository created by Terraform."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "tqer39"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "private"
      + vulnerability_alerts        = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"1903002264c70054e2e211ca4ae212096b631ef8","Target":"repository","Vars":{},"WorkflowName":"Terraform - AWS - Portfolio"} -->